# FailedReplaceCurveElemCurveDriver Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..GeometryFailures..::..FailedReplaceCurveElemCurveDriver Property
BuiltInFailures..::..GeometryFailures Class See Also
---
Failed to replace curve elem curve driver.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId FailedReplaceCurveElemCurveDriver { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FailedReplaceCurveElemCurveDriver As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ FailedReplaceCurveElemCurveDriver {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..GeometryFailures Class
Autodesk.Revit.DB Namespace